

#+TITLE: Modernes C++\linebreak \small...für Programmierer \hfill Unit 07: Modularisierung
#+AUTHOR: Dr. Günter Kolousek
#+OPTIONS: H:1 toc:nil
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [presentation]
#+BEAMER_THEME: Execushares
#+COLUMNS: %45ITEM %10BEAMER_ENV(Env) %10BEAMER_ACT(Act) %4BEAMER_COL(Col) %8BEAMER_OPT(Opt)

#+LATEX_HEADER:\usepackage{pgfpages}
# +LATEX_HEADER:\pgfpagesuselayout{2 on 1}[a4paper,border shrink=5mm]
# +LATEX: \mode<handout>{\setbeamercolor{background canvas}{bg=black!5}}
#+LATEX_HEADER:\usepackage{xspace}
#+LATEX: \newcommand{\cpp}{C++\xspace}
#+LATEX: \newcommand{\cppXVII}{C++17\xspace}

* Statisch vs. dynamisch
#+header: :exports code :results output :tangle src/dynstatic.cpp :flags -std=c++1y
#+BEGIN_SRC C++
#include <iostream>  // dynstatic.cpp
using namespace std;
int main() {
    cout << "Hello, World!"s << endl;
}
#+END_SRC

#+begin_src sh :exports both :results output
g++ -std=c++1y src/dynstatic.cpp -o go
ls -l go|awk '{print $5}'
g++ -std=c++1y -static src/dynstatic.cpp -o go
ls -l go|awk '{print $5}'
#+end_src

#+RESULTS:
: 7568
: 2024000

* Speicherabbild -- 2
#+header: :exports both :results output :tangle src/stack_heap.cpp :flags -std=c++1y
#+BEGIN_SRC C++
#include <iostream>  // stack_heap.cpp
using namespace std;
int main() {
    int i;
    int j;
    int k;
    int* p1 = new int;
    int* p2 = new int;
    int* p3 = new int;
    cout << &i << ' ' << &j << ' ' << &k << endl;
    cout<< &*p1<< ' '<< &*p2<< ' '<< &*p3<< endl;
}
#+END_SRC

#+RESULTS:
: 0xbfed5da0 0xbfed5d9c 0xbfed5d98
: 0x8340a10 0x8340a20 0x8340a30
